---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.FieldIndex
source: html/9abc75e0-3ae0-9ed8-c6b3-9bc352e4a862.htm
---
# Autodesk.Revit.DB.ScheduleField.FieldIndex Property

The index of the field in the containing ScheduleDefinition.

## Syntax (C#)
```csharp
public int FieldIndex { get; }
```